#ifndef PROJECT_FISH_H
#define PROJECT_FISH_H

//------------------------------------------------------------------------------
// fish.h - содержит описание рыбы.
//------------------------------------------------------------------------------

#include <stdio.h>
#include "rnd.h"

//------------------------------------------------------------------------------
// Структура рыбы с уникальным параметром - место проживания.
struct fish {
    enum area { RIVER, SEA, LAKE } ar;
};

// Ввод параметров рыбы из файла.
int In(fish* fsh, FILE* input);

// Случайный ввод параметров рыбы.
void InRnd(fish* fsh);

// Получение места обитания рыбы.
const char * GetName(fish::area index);

#endif //PROJECT_FISH_H
