#ifndef PROJECT_BIRD_H
#define PROJECT_BIRD_H

//------------------------------------------------------------------------------
// bird.h - содержит описание птицы.
//------------------------------------------------------------------------------

#include <stdio.h>
#include "rnd.h"
#include "stdbool.h"

//------------------------------------------------------------------------------
// Структура птицы с уникальным параметром - отношение к перелёту.
struct bird {
    bool migration;
};

// Ввод параметров птицы из файла.
int In(bird* brd, FILE* input);

// Случайный ввод параметров птицы.
void InRnd(bird* brd);

// Получение статуса миграции птицы.
const char* GetName(int index);

#endif //PROJECT_BIRD_H
